# Cleanup

In [125]:
import pandas as pd
import chardet

### Minimum Wage

In [126]:
with open("Resources/Minimum_Wage_Data.csv", "rb") as rawdata:
    result = chardet.detect(rawdata.read(1000))

print(result)

{'encoding': 'ascii', 'confidence': 1.0, 'language': ''}

In [127]:
minimum_wage = "Resources/Minimum_Wage_Data.csv"
minimum_wage_df = pd.read_csv(minimum_wage, encoding="latin1") # Chris help, latin1 works to encode without errors
minimum_wage_df.head()

,Year,State,Table_Data,High.Value,Low.Value,CPI.Average,High.2018,Low.2018
0,1968,Alabama,...,0.00000,0.00000,34.783333,0.00,0.00
1,1968,Alaska,2.1,2.10000,2.10000,34.783333,15.12,15.12
2,1968,Arizona,18.72 - 26.40/wk(b),0.66000,0.46800,34.783333,4.75,3.37
3,1968,Arkansas,1.25/day(b),0.15625,0.15625,34.783333,1.12,1.12
4,1968,California,1.65(b),1.65000,1.65000,34.783333,11.88,11.88

In [128]:
minimum_wage_df_start_clean = minimum_wage_df[['Year', 'State', 'Table_Data']]
minimum_wage_df_start_clean.head()

   Year       State           Table_Data
0  1968     Alabama                  ...
1  1968      Alaska                  2.1
2  1968     Arizona  18.72 - 26.40/wk(b)
3  1968    Arkansas          1.25/day(b)
4  1968  California              1.65(b)

In [129]:
ca_df = minimum_wage_df_start_clean.loc[(minimum_wage_df_start_clean['State'] == 'California')]
ca_df.head()

     Year       State Table_Data
4    1968  California    1.65(b)
59   1969  California    1.65(b)
114  1970  California    1.65(b)
169  1971  California    1.65(b)
224  1972  California    1.65(b)

In [130]:
minimum_wage_df_fixing = ca_df.loc[(ca_df['Year'] >=2011) & (ca_df['Year']<=2016)]

minimum_wage_df_FINAL = minimum_wage_df_fixing.replace(to_replace='California', value='CA')
minimum_wage_df_FINAL

      Year State Table_Data
2369  2011    CA          8
2424  2012    CA          8
2479  2013    CA          8
2534  2014    CA          9
2589  2015    CA          9
2644  2016    CA         10

In [131]:
print(minimum_wage_df_FINAL.columns)

Index(['Year', 'State', 'Table_Data'], dtype='object')

### Rent Prices

In [132]:
rent_prices = "Resources/price.csv"
rent_prices_df = pd.read_csv(rent_prices)
rent_prices_df.head()

,City Code,City,Metro,County,State,Population Rank,November 2010,December 2010,January 2011,February 2011,...,April 2016,May 2016,June 2016,July 2016,August 2016,September 2016,October 2016,November 2016,December 2016,January 2017
0,6181,New York,New York,Queens,NY,1,NaN,NaN,NaN,NaN,...,2334,2339,2345,2344,2336,2324,2318,2321,2321,2322
1,12447,Los Angeles,Los Angeles,Los Angeles,CA,2,2184.0,2184.0,2183.0,2188.0,...,2637,2662,2687,2704,2716,2723,2731,2740,2748,2753
2,17426,Chicago,Chicago,Cook,IL,3,1563.0,1555.0,1547.0,1537.0,...,1684,1686,1687,1685,1681,1675,1668,1656,1644,1632
3,39051,Houston,Houston,Harris,TX,4,1198.0,1199.0,1199.0,1200.0,...,1444,1446,1446,1443,1440,1438,1437,1437,1435,1430
4,13271,Philadelphia,Philadelphia,Philadelphia,PA,5,1092.0,1099.0,1094.0,1087.0,...,1206,1211,1218,1222,1223,1220,1216,1211,1209,1212

In [133]:
rent_prices_ca_df = rent_prices_df.loc[rent_prices_df.State == 'CA']
rent_prices_ca_df.head()

,City Code,City,Metro,County,State,Population Rank,November 2010,December 2010,January 2011,February 2011,...,April 2016,May 2016,June 2016,July 2016,August 2016,September 2016,October 2016,November 2016,December 2016,January 2017
1,12447,Los Angeles,Los Angeles,Los Angeles,CA,2,2184.0,2184.0,2183.0,2188.0,...,2637,2662,2687,2704,2716,2723,2731,2740,2748,2753
8,54296,San Diego,San Diego,San Diego,CA,9,2070.0,2059.0,2043.0,2030.0,...,2414,2428,2438,2442,2441,2442,2449,2457,2465,2469
10,33839,San Jose,San Jose,Santa Clara,CA,11,2359.0,2367.0,2360.0,2343.0,...,3347,3368,3386,3391,3383,3363,3341,3320,3300,3286
12,20330,San Francisco,San Francisco,San Francisco,CA,13,3188.0,3207.0,3189.0,3127.0,...,4527,4519,4517,4511,4500,4488,4472,4457,4424,4382
33,18203,Fresno,Fresno,Fresno,CA,34,1260.0,1249.0,1242.0,1228.0,...,1209,1214,1216,1217,1217,1221,1226,1231,1236,1241

In [149]:
rent_prices_ca_df_all = rent_prices_ca_df.drop(columns={'Population Rank',
                                                                'Metro', 
                                                                'November 2010', 
                                                                'December 2010',
                                                                'January 2017'})


rent_prices_ca_df_all.columns = rent_prices_ca_df_all.columns.str.replace(" ", "_")
rent_prices_ca_df_all.head()

,City_Code,City,County,State,January_2011,February_2011,March_2011,April_2011,May_2011,June_2011,...,March_2016,April_2016,May_2016,June_2016,July_2016,August_2016,September_2016,October_2016,November_2016,December_2016
1,12447,Los Angeles,Los Angeles,CA,2183.0,2188.0,2189.0,2189.0,2188.0,2191.0,...,2622,2637,2662,2687,2704,2716,2723,2731,2740,2748
8,54296,San Diego,San Diego,CA,2043.0,2030.0,2020.0,2015.0,2014.0,2014.0,...,2400,2414,2428,2438,2442,2441,2442,2449,2457,2465
10,33839,San Jose,Santa Clara,CA,2360.0,2343.0,2328.0,2325.0,2323.0,2328.0,...,3324,3347,3368,3386,3391,3383,3363,3341,3320,3300
12,20330,San Francisco,San Francisco,CA,3189.0,3127.0,3040.0,2970.0,2916.0,2879.0,...,4535,4527,4519,4517,4511,4500,4488,4472,4457,4424
33,18203,Fresno,Fresno,CA,1242.0,1228.0,1213.0,1204.0,1189.0,1178.0,...,1206,1209,1214,1216,1217,1217,1221,1226,1231,1236

In [135]:
rent_prices_2011_df = rent_prices_ca_df_all.iloc[:, 0:16]
rent_prices_2011_df.head()

,City_Code,City,County,State,January_2011,February_2011,March_2011,April_2011,May_2011,June_2011,July_2011,August_2011,September_2011,October_2011,November_2011,December_2011
1,12447,Los Angeles,Los Angeles,CA,2183.0,2188.0,2189.0,2189.0,2188.0,2191.0,2189.0,2186.0,2183.0,2183.0,2182.0,2178.0
8,54296,San Diego,San Diego,CA,2043.0,2030.0,2020.0,2015.0,2014.0,2014.0,2014.0,2011.0,2011.0,2010.0,2007.0,2013.0
10,33839,San Jose,Santa Clara,CA,2360.0,2343.0,2328.0,2325.0,2323.0,2328.0,2333.0,2336.0,2334.0,2335.0,2338.0,2346.0
12,20330,San Francisco,San Francisco,CA,3189.0,3127.0,3040.0,2970.0,2916.0,2879.0,2848.0,2848.0,2868.0,2907.0,2935.0,2958.0
33,18203,Fresno,Fresno,CA,1242.0,1228.0,1213.0,1204.0,1189.0,1178.0,1166.0,1163.0,1160.0,1161.0,1154.0,1151.0

In [151]:
print(rent_prices_2011_df.dtypes)

City_Code           int64
City               object
County             object
State              object
January_2011      float64
February_2011     float64
March_2011        float64
April_2011        float64
May_2011          float64
June_2011         float64
July_2011         float64
August_2011       float64
September_2011    float64
October_2011      float64
November_2011     float64
December_2011     float64
dtype: object

In [137]:
rent_prices_info_df = rent_prices_ca_df_all.iloc[:, 0:4]
rent_prices_info_df.head()

    City_Code           City         County State
1       12447    Los Angeles    Los Angeles    CA
8       54296      San Diego      San Diego    CA
10      33839       San Jose    Santa Clara    CA
12      20330  San Francisco  San Francisco    CA
33      18203         Fresno         Fresno    CA

In [138]:
rent_2012_df = rent_prices_ca_df_all.iloc[:, 16:28]
rent_2012_df.head()

,January_2012,February_2012,March_2012,April_2012,May_2012,June_2012,July_2012,August_2012,September_2012,October_2012,November_2012,December_2012
1,2172.0,2175.0,2177.0,2183,2186,2190,2192,2189,2189,2185,2183,2186
8,2019.0,2020.0,2015.0,2006,2000,2002,2009,2020,2032,2038,2034,2031
10,2359.0,2366.0,2370.0,2373,2383,2401,2412,2414,2413,2416,2426,2444
12,2974.0,2983.0,3001.0,3019,3039,3063,3089,3104,3094,3062,3021,3002
33,1148.0,1150.0,1151.0,1146,1144,1141,1143,1145,1147,1145,1139,1137

In [139]:
rent_prices_2012_df = pd.merge(rent_prices_info_df, rent_2012_df, how='outer', left_index=True, right_index=True)
rent_prices_2012_df.head()

,City_Code,City,County,State,January_2012,February_2012,March_2012,April_2012,May_2012,June_2012,July_2012,August_2012,September_2012,October_2012,November_2012,December_2012
1,12447,Los Angeles,Los Angeles,CA,2172.0,2175.0,2177.0,2183,2186,2190,2192,2189,2189,2185,2183,2186
8,54296,San Diego,San Diego,CA,2019.0,2020.0,2015.0,2006,2000,2002,2009,2020,2032,2038,2034,2031
10,33839,San Jose,Santa Clara,CA,2359.0,2366.0,2370.0,2373,2383,2401,2412,2414,2413,2416,2426,2444
12,20330,San Francisco,San Francisco,CA,2974.0,2983.0,3001.0,3019,3039,3063,3089,3104,3094,3062,3021,3002
33,18203,Fresno,Fresno,CA,1148.0,1150.0,1151.0,1146,1144,1141,1143,1145,1147,1145,1139,1137

In [140]:
rent_2013_df = rent_prices_ca_df_all.iloc[:, 28:40]
rent_2013_df.head()

,January_2013,February_2013,March_2013,April_2013,May_2013,June_2013,July_2013,August_2013,September_2013,October_2013,November_2013,December_2013
1,2194,2203,2212,2222,2229,2236,2239,2246,2255,2267,2278,2283
8,2029,2034,2041,2053,2064,2076,2085,2095,2102,2111,2118,2132
10,2467,2490,2513,2526,2525,2518,2510,2508,2515,2526,2538,2552
12,3024,3072,3149,3222,3277,3312,3337,3356,3374,3381,3395,3418
33,1134,1133,1135,1137,1141,1146,1153,1157,1160,1162,1160,1161

In [141]:
rent_prices_2013_df = pd.merge(rent_prices_info_df, rent_2013_df, how='outer', left_index=True, right_index=True)
rent_prices_2013_df.head()

,City_Code,City,County,State,January_2013,February_2013,March_2013,April_2013,May_2013,June_2013,July_2013,August_2013,September_2013,October_2013,November_2013,December_2013
1,12447,Los Angeles,Los Angeles,CA,2194,2203,2212,2222,2229,2236,2239,2246,2255,2267,2278,2283
8,54296,San Diego,San Diego,CA,2029,2034,2041,2053,2064,2076,2085,2095,2102,2111,2118,2132
10,33839,San Jose,Santa Clara,CA,2467,2490,2513,2526,2525,2518,2510,2508,2515,2526,2538,2552
12,20330,San Francisco,San Francisco,CA,3024,3072,3149,3222,3277,3312,3337,3356,3374,3381,3395,3418
33,18203,Fresno,Fresno,CA,1134,1133,1135,1137,1141,1146,1153,1157,1160,1162,1160,1161

In [142]:
rent_2014_df = rent_prices_ca_df_all.iloc[:, 40:52]
rent_2014_df.head()

,January_2014,February_2014,March_2014,April_2014,May_2014,June_2014,July_2014,August_2014,September_2014,October_2014,November_2014,December_2014
1,2285,2283,2285,2283,2285,2288,2303,2320,2343,2367,2395,2423
8,2140,2144,2148,2153,2155,2155,2159,2169,2184,2201,2217,2237
10,2574,2587,2601,2610,2619,2630,2663,2716,2785,2847,2897,2933
12,3464,3506,3549,3588,3635,3680,3715,3747,3793,3866,3941,4018
33,1161,1164,1164,1164,1164,1163,1159,1153,1152,1155,1159,1165

In [143]:
rent_prices_2014_df = pd.merge(rent_prices_info_df, rent_2014_df, how='outer', left_index=True, right_index=True)
rent_prices_2014_df.head()

,City_Code,City,County,State,January_2014,February_2014,March_2014,April_2014,May_2014,June_2014,July_2014,August_2014,September_2014,October_2014,November_2014,December_2014
1,12447,Los Angeles,Los Angeles,CA,2285,2283,2285,2283,2285,2288,2303,2320,2343,2367,2395,2423
8,54296,San Diego,San Diego,CA,2140,2144,2148,2153,2155,2155,2159,2169,2184,2201,2217,2237
10,33839,San Jose,Santa Clara,CA,2574,2587,2601,2610,2619,2630,2663,2716,2785,2847,2897,2933
12,20330,San Francisco,San Francisco,CA,3464,3506,3549,3588,3635,3680,3715,3747,3793,3866,3941,4018
33,18203,Fresno,Fresno,CA,1161,1164,1164,1164,1164,1163,1159,1153,1152,1155,1159,1165

In [144]:
rent_2015_df = rent_prices_ca_df_all.iloc[:, 52:64]
rent_2015_df.head()

,January_2015,February_2015,March_2015,April_2015,May_2015,June_2015,July_2015,August_2015,September_2015,October_2015,November_2015,December_2015
1,2445,2464,2479,2493,2502,2511,2521,2536,2546,2555,2564,2577
8,2256,2274,2291,2304,2317,2328,2337,2342,2343,2343,2340,2345
10,2960,2978,3010,3048,3090,3130,3164,3190,3213,3237,3262,3281
12,4076,4125,4172,4213,4249,4284,4337,4387,4441,4488,4522,4537
33,1169,1175,1181,1186,1192,1197,1202,1205,1202,1197,1193,1194

In [145]:
rent_prices_2015_df = pd.merge(rent_prices_info_df, rent_2015_df, how='outer', left_index=True, right_index=True)
rent_prices_2015_df.head()

,City_Code,City,County,State,January_2015,February_2015,March_2015,April_2015,May_2015,June_2015,July_2015,August_2015,September_2015,October_2015,November_2015,December_2015
1,12447,Los Angeles,Los Angeles,CA,2445,2464,2479,2493,2502,2511,2521,2536,2546,2555,2564,2577
8,54296,San Diego,San Diego,CA,2256,2274,2291,2304,2317,2328,2337,2342,2343,2343,2340,2345
10,33839,San Jose,Santa Clara,CA,2960,2978,3010,3048,3090,3130,3164,3190,3213,3237,3262,3281
12,20330,San Francisco,San Francisco,CA,4076,4125,4172,4213,4249,4284,4337,4387,4441,4488,4522,4537
33,18203,Fresno,Fresno,CA,1169,1175,1181,1186,1192,1197,1202,1205,1202,1197,1193,1194

In [146]:
rent_2016_df = rent_prices_ca_df_all.iloc[:, 64:76]
rent_2016_df.head()

,January_2016,February_2016,March_2016,April_2016,May_2016,June_2016,July_2016,August_2016,September_2016,October_2016,November_2016,December_2016
1,2596,2607,2622,2637,2662,2687,2704,2716,2723,2731,2740,2748
8,2360,2379,2400,2414,2428,2438,2442,2441,2442,2449,2457,2465
10,3296,3304,3324,3347,3368,3386,3391,3383,3363,3341,3320,3300
12,4547,4540,4535,4527,4519,4517,4511,4500,4488,4472,4457,4424
33,1197,1202,1206,1209,1214,1216,1217,1217,1221,1226,1231,1236

In [147]:
rent_prices_2016_df = pd.merge(rent_prices_info_df, rent_2016_df, how='outer', left_index=True, right_index=True)
rent_prices_2016_df.head()

,City_Code,City,County,State,January_2016,February_2016,March_2016,April_2016,May_2016,June_2016,July_2016,August_2016,September_2016,October_2016,November_2016,December_2016
1,12447,Los Angeles,Los Angeles,CA,2596,2607,2622,2637,2662,2687,2704,2716,2723,2731,2740,2748
8,54296,San Diego,San Diego,CA,2360,2379,2400,2414,2428,2438,2442,2441,2442,2449,2457,2465
10,33839,San Jose,Santa Clara,CA,3296,3304,3324,3347,3368,3386,3391,3383,3363,3341,3320,3300
12,20330,San Francisco,San Francisco,CA,4547,4540,4535,4527,4519,4517,4511,4500,4488,4472,4457,4424
33,18203,Fresno,Fresno,CA,1197,1202,1206,1209,1214,1216,1217,1217,1221,1226,1231,1236

### Transfer to database (Postgres)